DataProcessors/АРМ_Водитель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>АРМ_Водитель</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекВодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗаданий_Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>54</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗаданий_ТекСтрока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗаданий_ТекСтраница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗаданий_КоличествоСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗаданий_КоличествоСтраниц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеНакладных_Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>54</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокНакладных_Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>54</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокНакладных_ТекСтрока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокНакладных_ТекСтраница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокНакладных_КоличествоСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокНакладных_КоличествоСтраниц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокТоваров_Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>54</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокТоваров_ТекСтрока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокТоваров_ТекСтраница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокТоваров_КоличествоСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокТоваров_КоличествоСтраниц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекЗадание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекРеализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекНомерСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекСуммаРеализации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводимаяСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаРеализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриемДенег</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекОстатокВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТоваров_Таблица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реализация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВводимоеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСтороннийСклад</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиСч</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокГрузовыхМест_Таблица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГрузовоеМесто</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/АРМ_Водитель/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ПредСтраница, СписокЗаданий_ПредОбласть, СписокТоваров_ПредОбласть;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоличествоСтрокЗаданий = 5;
	КоличествоСтрокТоваров = 5;
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь.ФизЛицо) Тогда
		Объект.ТекВодитель = ПараметрыСеанса.ТекущийПользователь.ФизЛицо;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеИВывестиВТаблицы()
	
	ПолучитьТаблицы();
	
	Если ЗначениеЗаполнено(Объект.Задание) Тогда
		
		СписокЗаданий_ПолучитьТаблицу();
		СписокЗаданий_Вывести();
		
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ПолучитьТаблицы()
	
	Если Не ЗначениеЗаполнено(Объект.ТекДата) Тогда
		Объект.ТекДата = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаданиеНаДоставкуДоставка.Ссылка КАК ЗаданиеНаДоставку,
	|	ЗаданиеНаДоставкуДоставка.Контрагент,
	|	СУММА(ЗаданиеНаДоставкуДоставка.Количество) КАК КоличествоМест,
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка КАК Реализация,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Организация = &ОрганизацияДляПриемаНаличных
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЕСТЬNULL(Реализации_ОплатаНаличными.ОплатаНаличными, ЛОЖЬ)
	|		КОНЕЦ) КАК ОплатаНаличными,
	|	МАКСИМУМ(ЕСТЬNULL(ОчередьПечатиККМ.Отмена, ЛОЖЬ)) КАК Отмена,
	|	МАКСИМУМ(ЕСТЬNULL(ОчередьПечатиККМ.Деньги, ЛОЖЬ)) КАК Деньги,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ ОчередьПечатиККМ.ДокументЧек ЕСТЬ NULL
	|					И ОчередьПечатиККМ.ДокументЧек <> ЗНАЧЕНИЕ(Документ.ПриходныйКассовыйОрдер.ПустаяСсылка)
	|				ТОГДА ОчередьПечатиККМ.ТекСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПринятоДенег,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ НеДоставленныеРеализации.Объект ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК НеДоставлен
	|ПОМЕСТИТЬ ЗаданияНаДоставку
	|ИЗ
	|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ЗначенияСвойствОбъектов.Объект КАК Объект
	|			ИЗ
	|				РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|			ГДЕ
	|				ЗначенияСвойствОбъектов.Значение В (&НеДоставлен)
	|				И ЗначенияСвойствОбъектов.Свойство = &СтатусДоставки
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ЗначенияСвойствОбъектов.Объект) КАК НеДоставленныеРеализации
	|			ПО РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка = НеДоставленныеРеализации.Объект
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка КАК Реализация,
	|				МАКСИМУМ(ВЫБОР
	|						КОГДА РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Организация = &ОрганизацияДляПриемаНаличных
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЕСТЬNULL(ПродажиОбороты.ЗаказПокупателя.ОплатаНаличными, ЛОЖЬ)
	|					КОНЕЦ) КАК ОплатаНаличными
	|			ИЗ
	|				Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
	|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты КАК ПродажиОбороты
	|						ПО РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка = ПродажиОбороты.ДокументПродажи
	|					ПО ЗаданиеНаДоставкуДоставка.ДокументСборки = РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки
	|			ГДЕ
	|				НАЧАЛОПЕРИОДА(ЗаданиеНаДоставкуДоставка.Ссылка.Дата, ДЕНЬ) = &ТекущаяДата
	|				И ЗаданиеНаДоставкуДоставка.Ссылка.Водитель = &ТекущийВодитель
	|				И НЕ РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка ЕСТЬ NULL
	|				И ЗаданиеНаДоставкуДоставка.Ссылка.Проведен
	|				И РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Проведен
	|			
	|			СГРУППИРОВАТЬ ПО
	|				РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка) КАК Реализации_ОплатаНаличными
	|			ПО РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка = Реализации_ОплатаНаличными.Реализация
	|		ПО ЗаданиеНаДоставкуДоставка.ДокументСборки = РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОчередьПечатиККМ КАК ОчередьПечатиККМ
	|		ПО (ОчередьПечатиККМ.ТекЗадание = ЗаданиеНаДоставкуДоставка.Ссылка)
	|			И ЗаданиеНаДоставкуДоставка.Контрагент = ОчередьПечатиККМ.ТекКонтрагент
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ЗаданиеНаДоставкуДоставка.Ссылка.Дата, ДЕНЬ) = &ТекущаяДата
	|	И ЗаданиеНаДоставкуДоставка.Ссылка.Водитель = &ТекущийВодитель
	|	И НЕ РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка ЕСТЬ NULL
	|	И ЗаданиеНаДоставкуДоставка.Ссылка.Проведен
	|	И РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданиеНаДоставкуДоставка.Ссылка,
	|	ЗаданиеНаДоставкуДоставка.Контрагент,
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаданиеНаДоставкуДоставкаПоказная.Ссылка,
	|	ЗаданиеНаДоставкуДоставкаПоказная.Контрагент,
	|	СУММА(0),
	|	NULL,
	|	МАКСИМУМ(ИСТИНА),
	|	МАКСИМУМ(ЕСТЬNULL(ОчередьПечатиККМ.Отмена, ЛОЖЬ)),
	|	МАКСИМУМ(ЕСТЬNULL(ОчередьПечатиККМ.Деньги, ЛОЖЬ)),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ОчередьПечатиККМ.ДокументЧек ЕСТЬ NULL
	|					И ОчередьПечатиККМ.ДокументЧек <> ЗНАЧЕНИЕ(Документ.ПриходныйКассовыйОрдер.ПустаяСсылка)
	|				ТОГДА ОчередьПечатиККМ.ТекСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ЗаданиеНаДоставку.ДоставкаПоказная КАК ЗаданиеНаДоставкуДоставкаПоказная
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОчередьПечатиККМ КАК ОчередьПечатиККМ
	|		ПО ЗаданиеНаДоставкуДоставкаПоказная.Ссылка = ОчередьПечатиККМ.ТекЗадание
	|			И ЗаданиеНаДоставкуДоставкаПоказная.Контрагент = ОчередьПечатиККМ.ТекКонтрагент
	|ГДЕ
	|	ЗаданиеНаДоставкуДоставкаПоказная.Деньги
	|	И НАЧАЛОПЕРИОДА(ЗаданиеНаДоставкуДоставкаПоказная.Ссылка.Дата, ДЕНЬ) = &ТекущаяДата
	|	И ЗаданиеНаДоставкуДоставкаПоказная.Ссылка.Проведен
	|	И ЗаданиеНаДоставкуДоставкаПоказная.Ссылка.Водитель = &ТекущийВодитель
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданиеНаДоставкуДоставкаПоказная.Ссылка,
	|	ЗаданиеНаДоставкуДоставкаПоказная.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданияНаДоставку.ЗаданиеНаДоставку,
	|	ЗаданияНаДоставку.Контрагент,
	|	РеализацияТоваровУслугТовары.Ссылка КАК Реализация,
	|	РеализацияТоваровУслугТовары.Ссылка.Номер КАК НомерНакладной,
	|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтрокиСч,
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.Количество,
	|	РеализацияТоваровУслугТовары.Сумма,
	|	ВЫБОР
	|		КОГДА СторонниеСклады.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоСтороннийСклад
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	ЗаданияНаДоставку КАК ЗаданияНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СторонниеСклады КАК СторонниеСклады
	|			ПО РеализацияТоваровУслугТовары.ЗаказПокупателя.IDСклада = СторонниеСклады.Идентификатор
	|		ПО ЗаданияНаДоставку.Реализация = РеализацияТоваровУслугТовары.Ссылка
	|ГДЕ
	|	НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданияНаДоставку.Реализация,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(ОчередьПечатиККМ.ТекРеализация, ЛОЖЬ) <> ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ЕстьОплата
	|ПОМЕСТИТЬ Оплаты
	|ИЗ
	|	ЗаданияНаДоставку КАК ЗаданияНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОчередьПечатиККМ КАК ОчередьПечатиККМ
	|		ПО ЗаданияНаДоставку.ЗаданиеНаДоставку = ОчередьПечатиККМ.ТекЗадание
	|			И ЗаданияНаДоставку.Контрагент = ОчередьПечатиККМ.ТекКонтрагент
	|			И ЗаданияНаДоставку.Реализация = ОчередьПечатиККМ.ТекРеализация
	|ГДЕ
	|	НЕ ОчередьПечатиККМ.Деньги
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданияНаДоставку.Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданияНаДоставку.Контрагент КАК Контрагент,
	|	ЗаданияНаДоставку.Реализация,
	|	ЗаданияНаДоставку.Контрагент.ПриоритетВМаршруте КАК ПриоритетВМаршруте,
	|	СУММА(ЗаданияНаДоставку.КоличествоМест) КАК КоличествоМест,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТелефонКонтрагента.Объект ЕСТЬ NULL
	|				ТОГДА """"
	|			ИНАЧЕ ТелефонКонтрагента.Представление
	|		КОНЕЦ КАК СТРОКА(100)) КАК Телефон,
	|	ЗаданияНаДоставку.ЗаданиеНаДоставку,
	|	ЗаданияНаДоставку.Реализация.СуммаДокумента КАК Сумма,
	|	ЕСТЬNULL(Оплаты.ЕстьОплата, ЛОЖЬ) КАК ЕстьОплата,
	|	ЗаданияНаДоставку.ОплатаНаличными,
	|	МАКСИМУМ(ЗаданияНаДоставку.Отмена) КАК Отмена,
	|	МАКСИМУМ(ЗаданияНаДоставку.Деньги) КАК Деньги,
	|	ЗаданияНаДоставку.Контрагент.ВремяПриемкиТовара КАК ВремяПриемкиТовара,
	|	СУММА(ЗаданияНаДоставку.СуммаПринятоДенег) КАК СуммаПринятоДенег,
	|	МАКСИМУМ(ЕСТЬNULL(ЗаданияНаДоставку.НеДоставлен, ЛОЖЬ)) КАК НеДоставлен,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА АдресДоставки.Объект ЕСТЬ NULL
	|				ТОГДА """"
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПОДСТРОКА(АдресДоставки.Поле4, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле6, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле7, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	|						ТОГДА АдресДоставки.Представление
	|					ИНАЧЕ АдресДоставки.Поле4 + "" "" + АдресДоставки.Поле6 + "" ул, дом № "" + АдресДоставки.Поле7 + "" "" + ВЫБОР
	|							КОГДА ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	|								ТОГДА """"
	|							ИНАЧЕ "" корпус "" + АдресДоставки.Поле8
	|						КОНЕЦ + "" "" + ВЫБОР
	|							КОГДА ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	|								ТОГДА """"
	|							ИНАЧЕ "" оф."" + АдресДоставки.Поле9
	|						КОНЕЦ + """"
	|				КОНЕЦ
	|		КОНЕЦ КАК СТРОКА(999)) КАК АдресДоставки
	|ИЗ
	|	ЗаданияНаДоставку КАК ЗаданияНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресДоставки
	|		ПО ЗаданияНаДоставку.Контрагент = АдресДоставки.Объект
	|			И (АдресДоставки.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (АдресДоставки.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ТелефонКонтрагента
	|		ПО ЗаданияНаДоставку.Контрагент = ТелефонКонтрагента.Объект
	|			И (ТелефонКонтрагента.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (ТелефонКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Оплаты КАК Оплаты
	|		ПО ЗаданияНаДоставку.Реализация = Оплаты.Реализация
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданияНаДоставку.Контрагент,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТелефонКонтрагента.Объект ЕСТЬ NULL
	|				ТОГДА """"
	|			ИНАЧЕ ТелефонКонтрагента.Представление
	|		КОНЕЦ КАК СТРОКА(100)),
	|	ЗаданияНаДоставку.Контрагент.ПриоритетВМаршруте,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА АдресДоставки.Объект ЕСТЬ NULL
	|				ТОГДА """"
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПОДСТРОКА(АдресДоставки.Поле4, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле6, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле7, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	|						ТОГДА АдресДоставки.Представление
	|					ИНАЧЕ АдресДоставки.Поле4 + "" "" + АдресДоставки.Поле6 + "" ул, дом № "" + АдресДоставки.Поле7 + "" "" + ВЫБОР
	|							КОГДА ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	|								ТОГДА """"
	|							ИНАЧЕ "" корпус "" + АдресДоставки.Поле8
	|						КОНЕЦ + "" "" + ВЫБОР
	|							КОГДА ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	|								ТОГДА """"
	|							ИНАЧЕ "" оф."" + АдресДоставки.Поле9
	|						КОНЕЦ + """"
	|				КОНЕЦ
	|		КОНЕЦ КАК СТРОКА(999)),
	|	ЗаданияНаДоставку.ЗаданиеНаДоставку,
	|	ЗаданияНаДоставку.Реализация.СуммаДокумента,
	|	ЗаданияНаДоставку.Реализация,
	|	ЕСТЬNULL(Оплаты.ЕстьОплата, ЛОЖЬ),
	|	ЗаданияНаДоставку.ОплатаНаличными,
	|	ЗаданияНаДоставку.Контрагент.ВремяПриемкиТовара
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриоритетВМаршруте,
	|	Контрагент
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаданияНаДоставку.ЗаданиеНаДоставку,
	|	ЗаданияНаДоставку.Контрагент,
	|	ЗаданияНаДоставку.Реализация,
	|	ЗаданияНаДоставку.ОплатаНаличными КАК ОплатаНаличными
	|ИЗ
	|	ЗаданияНаДоставку КАК ЗаданияНаДоставку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.ЗаданиеНаДоставку,
	|	Товары.Контрагент,
	|	Товары.Реализация КАК Реализация,
	|	Товары.НомерНакладной,
	|	Товары.НомерСтрокиСч КАК НомерСтрокиСч,
	|	Товары.Номенклатура,
	|	Товары.Количество,
	|	Товары.Сумма,
	|	Товары.ЭтоСтороннийСклад
	|ИЗ
	|	Товары КАК Товары
	|
	|УПОРЯДОЧИТЬ ПО
	|	Реализация,
	|	НомерСтрокиСч
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданияНаДоставку.ЗаданиеНаДоставку
	|ИЗ
	|	ЗаданияНаДоставку КАК ЗаданияНаДоставку
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданияНаДоставку.ЗаданиеНаДоставку";
	
	Запрос.УстановитьПараметр("ОрганизацияДляПриемаНаличных", Константы.ОсновнаяОрганизацияДляОплатыНаличнымиДляВодителей.Получить());
	Запрос.УстановитьПараметр("ТекущаяДата", Объект.ТекДата);
	Запрос.УстановитьПараметр("ТекущийВодитель", Объект.ТекВодитель);
	Запрос.УстановитьПараметр("СтатусДоставки", ПланыВидовХарактеристик.СвойстваОбъектов.СтатусДоставки);
	//-Кабанов А.В. 02.04.2024 # UT10-4391
	//Запрос.УстановитьПараметр("НеДоставлен", Перечисления.СтатусыДоставки.ТоварНеДоставлен);
	СписокСтатусовНеДоставлен = Новый СписокЗначений;
	СписокСтатусовНеДоставлен.Добавить(Перечисления.СтатусыДоставки.ТоварНеДоставлен);
	СписокСтатусовНеДоставлен.Добавить(Перечисления.СтатусыДоставки.ПереносДоставки);
	Запрос.УстановитьПараметр("НеДоставлен", СписокСтатусовНеДоставлен);
	//-Кабанов А.В. 02.04.2024 # UT10-4391

	УстановитьПривилегированныйРежим(Истина);	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Объект.ДанныеНакладных_Адрес = ПоместитьВоВременноеХранилище(РезультатЗапроса, Новый УникальныйИдентификатор); 
	УстановитьПривилегированныйРежим(Ложь);
					
КонецПроцедуры

&НаСервере
Процедура СписокЗаданий_ПолучитьТаблицу()
	
	РезультатЗапроса = ПолучитьИзВременногоХранилища(Объект.ДанныеНакладных_Адрес);
	
	СтрокиДляУдаления = Новый Массив;
	
	СписокЗаданий_Таблица = РезультатЗапроса[3].Выгрузить();
	
	Для каждого Сп Из СписокЗаданий_Таблица Цикл
		
		Если Сп.ЗаданиеНаДоставку <> Объект.Задание Тогда
			СтрокиДляУдаления.Добавить(Сп);
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого Уд Из СтрокиДляУдаления Цикл
		СписокЗаданий_Таблица.Удалить(Уд);	
	КонецЦикла;
	
	Объект.СписокЗаданий_Адрес = ПоместитьВоВременноеХранилище(СписокЗаданий_Таблица, Новый УникальныйИдентификатор);
	Объект.СписокЗаданий_ТекСтрока = 1;
	Объект.СписокЗаданий_ТекСтраница = 1;
	Объект.СписокЗаданий_КоличествоСтрок = СписокЗаданий_Таблица.Количество();
	Объект.СписокЗаданий_КоличествоСтраниц = Цел(Объект.СписокЗаданий_КоличествоСтрок / КоличествоСтрокЗаданий);
	
	Если Цел(Объект.СписокЗаданий_КоличествоСтрок / КоличествоСтрокЗаданий) < Объект.СписокЗаданий_КоличествоСтрок / КоличествоСтрокЗаданий Тогда
		Объект.СписокЗаданий_КоличествоСтраниц = Объект.СписокЗаданий_КоличествоСтраниц + 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СписокЗаданий_Вывести()
	
	СписокЗаданий.Очистить();
	СписокЗаданий_Таблица = ПолучитьИзВременногоХранилища(Объект.СписокЗаданий_Адрес);		
	
	Макет = Обработки.АРМ_Водитель.ПолучитьМакет("СписокЗаданий");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	СписокЗаданий.Вывести(ОбластьМакета);
	
	Если Объект.СписокЗаданий_ТекСтраница > Объект.СписокЗаданий_КоличествоСтраниц Тогда
		Объект.СписокЗаданий_ТекСтраница = 1;
	ИначеЕсли Объект.СписокЗаданий_ТекСтраница < 1 Тогда
		Объект.СписокЗаданий_ТекСтраница = Объект.СписокЗаданий_КоличествоСтраниц;
	КонецЕсли;
	
	Элементы.СписокЗаданий_ТекСтраницаПредставление.Заголовок = "" + Объект.СписокЗаданий_ТекСтраница + " из " + Объект.СписокЗаданий_КоличествоСтраниц;
	Элементы.СписокЗаданий_Меньше.Доступность = НЕ (Объект.СписокЗаданий_КоличествоСтраниц = 1 Или Объект.СписокЗаданий_ТекСтраница = 1);
	Элементы.СписокЗаданий_Больше.Доступность = НЕ (Объект.СписокЗаданий_КоличествоСтраниц = 1 Или Объект.СписокЗаданий_ТекСтраница = Объект.СписокЗаданий_КоличествоСтраниц);
	
		
	Сч = (Объект.СписокЗаданий_ТекСтраница - 1) * КоличествоСтрокЗаданий;
	
	Для Сч = (Объект.СписокЗаданий_ТекСтраница - 1) * КоличествоСтрокЗаданий По Мин(Объект.СписокЗаданий_КоличествоСтрок - 1, (Объект.СписокЗаданий_ТекСтраница * КоличествоСтрокЗаданий - 1)) Цикл	
		
		ТекЗадание = СписокЗаданий_Таблица[Сч];
		
		ОтменаПоставки = ТекЗадание.Отмена;
		ОплатаНаличными = ТекЗадание.ОплатаНаличными;
		ПриемДенег = ТекЗадание.Деньги;
		НеДоставлен = ТекЗадание.НеДоставлен;
		
		Если ТекЗадание.ЕстьОплата ИЛИ (ТекЗадание.Реализация = NULL И ПриемДенег) ИЛИ НеДоставлен Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаОплата");	
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть(?(ОплатаНаличными, "СтрокаНал","Строка"));
		КонецЕсли;
		
		ОбластьМакета.Параметры.Заполнить(ТекЗадание);
		
		Если ЗначениеЗаполнено(ТекЗадание.ВремяПриемкиТовара) Тогда
			ОбластьМакета.Параметры.Контрагент = Строка(ОбластьМакета.Параметры.Контрагент) + Символы.ПС + "(" + ТекЗадание.ВремяПриемкиТовара + ")"; 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекЗадание.СуммаПринятоДенег) Тогда
			ОбластьМакета.Параметры.Сумма = Строка(ОбластьМакета.Параметры.Сумма) + Символы.ПС + "(" + ТекЗадание.СуммаПринятоДенег + ")"; 
		КонецЕсли;
		
		Структура = Новый Структура;
		Структура.Вставить("ЗаданиеНаДоставку", ТекЗадание.ЗаданиеНаДоставку);
		Структура.Вставить("Контрагент", ТекЗадание.Контрагент);
		Структура.Вставить("Реализация", ТекЗадание.Реализация);
		Структура.Вставить("Сумма", ТекЗадание.Сумма);
		Структура.Вставить("ЕстьОплата", ТекЗадание.ЕстьОплата);
		Структура.Вставить("ОплатаНаличными", ОплатаНаличными);
		Структура.Вставить("ПриемДенег", ПриемДенег);
		Структура.Вставить("НеДоставлен", НеДоставлен);
		
		Если ТекЗадание.ЕстьОплата Тогда
			
			Если ОтменаПоставки Тогда
				ОбластьМакета.Параметры.Статус = "Поставка была отменена" + ?(ПриемДенег, Символы.ПС + "Деньги приняты", "");
			Иначе
				ОбластьМакета.Параметры.Статус = ?(ОплатаНаличными, "Оплата произведена и передан товар", "Товар передан") + ?(ПриемДенег, Символы.ПС + "Деньги приняты", "");
			КонецЕсли;
			
		ИначеЕсли ТекЗадание.Реализация = NULL Тогда
			ОбластьМакета.Параметры.Статус = ?(ПриемДенег, "Деньги приняты", "Ожидание приема денег");	
		Иначе
			ОбластьМакета.Параметры.Статус = ?(ПриемДенег, "Деньги приняты", ?(НеДоставлен, "Товар не доставлен", "")); 
		КонецЕсли;   		
		
		ОбластьМакета.Параметры.Структура = Структура;
		СписокЗаданий.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	Если Объект.СписокЗаданий_ТекСтраница = Объект.СписокЗаданий_КоличествоСтраниц Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.Сумма = СписокЗаданий_Таблица.Итог("СуммаПринятоДенег");
		СписокЗаданий.Вывести(ОбластьМакета);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокЗаданий_УстановитьПервуюСтроку()
	
	Объект.СписокЗаданий_ТекСтрока = 1;
	Элементы.СписокЗаданий.ТекущаяОбласть = СписокЗаданий.Область(2, 1, 2, 5);
	СписокЗаданий_ВыделитьСтроку(1);

КонецПроцедуры

&НаКлиенте
Функция СписокЗаданий_ПолучитьКоличествоСтрокНаСтранице()
	
	Если Объект.СписокЗаданий_ТекСтраница = Объект.СписокЗаданий_КоличествоСтраниц Тогда
		Возврат КоличествоСтрокЗаданий - (Объект.СписокЗаданий_КоличествоСтраниц * КоличествоСтрокЗаданий - Объект.СписокЗаданий_КоличествоСтрок);
	Иначе
		Возврат КоличествоСтрокЗаданий;
	КонецЕсли;	

КонецФункции

&НаКлиенте
Процедура СписокЗаданий_Больше(Команда)
	
	Объект.СписокЗаданий_ТекСтраница = Объект.СписокЗаданий_ТекСтраница + 1;
	СписокЗаданий_Вывести();
	СписокЗаданий_УстановитьПервуюСтроку();

КонецПроцедуры

&НаКлиенте
Процедура СписокЗаданий_Меньше(Команда)
	
	Объект.СписокЗаданий_ТекСтраница = Объект.СписокЗаданий_ТекСтраница - 1;
	СписокЗаданий_Вывести();
	СписокЗаданий_УстановитьПервуюСтроку();

КонецПроцедуры

&НаКлиенте
Процедура СписокЗаданий_ВыделитьСтроку(НомерСтроки)	
	
	ОбластьТекущейСтроки = СписокЗаданий.Область(НомерСтроки + 1, 1, НомерСтроки + 1, 6);
	ОбластьТекущейСтроки.ЦветФона = WebЦвета.Желтый; 
	
	Если СписокЗаданий_ПредОбласть = Неопределено Тогда
		СписокЗаданий_ПредОбласть = ОбластьТекущейСтроки;
	ИначеЕсли НЕ СписокЗаданий_ПредОбласть.Имя = ОбластьТекущейСтроки.Имя Тогда  		
		
		Если ОбластьТекущейСтроки.Расшифровка <> Неопределено Тогда
			
			Расш = СписокЗаданий_ПредОбласть.Расшифровка; 		
			
			Если Расш <> Неопределено Тогда
				
				ОплатаНаличными = Расш.ОплатаНаличными;
				СписокЗаданий_ПредОбласть.ЦветФона = ?(Расш.ЕстьОплата ИЛИ (Расш.Реализация = NULL И Расш.ПриемДенег) 
				            ИЛИ Расш.НеДоставлен, WebЦвета.СветлоСерый, ?(ОплатаНаличными, WebЦвета.БледноЗеленый,WebЦвета.Белый));
				
			Иначе
				СписокЗаданий_ПредОбласть.ЦветФона = WebЦвета.Белый;
			КонецЕсли;
			
		Иначе
			СписокЗаданий_ПредОбласть.ЦветФона = WebЦвета.Белый;
		КонецЕсли;	
		
		СписокЗаданий_ПредОбласть = ОбластьТекущейСтроки;
		
	КонецЕсли; 
	
	Если ОбластьТекущейСтроки.Расшифровка <> Неопределено Тогда
		
		Если ОбластьТекущейСтроки.Расшифровка.ЕстьОплата 
			ИЛИ (ОбластьТекущейСтроки.Расшифровка.Реализация = NULL И ОбластьТекущейСтроки.Расшифровка.ПриемДенег) 
			ИЛИ ОбластьТекущейСтроки.Расшифровка.НеДоставлен Тогда
			ОбластьТекущейСтроки.ЦветФона = WebЦвета.СветлоСерый;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура СписокЗаданийПриАктивизацииОбласти(Элемент)
	
	Объект.СписокЗаданий_ТекСтрока = СписокЗаданий.ТекущаяОбласть.Верх - 1;
	
	Если Объект.СписокЗаданий_ТекСтрока < 1 Или Объект.СписокЗаданий_ТекСтрока > СписокЗаданий_ПолучитьКоличествоСтрокНаСтранице() Тогда
		СписокЗаданий_УстановитьПервуюСтроку();
	Иначе
		СписокЗаданий_ВыделитьСтроку(Объект.СписокЗаданий_ТекСтрока);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокЗаданийОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Расшифровка.НеДоставлен Тогда
		Возврат;
	ИначеЕсли Расшифровка.ЕстьОплата Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.Страница_ЕстьОплата;
	Иначе  		
				
		Объект.ТекЗадание = Расшифровка.ЗаданиеНаДоставку;
		Объект.ТекКонтрагент = Расшифровка.Контрагент;
		Объект.ТекРеализация = Расшифровка.Реализация;
		Объект.ТекСумма = Расшифровка.Сумма;
		Объект.ТекОстатокВзаиморасчетов = ПолучитьОстатокВзаиморасчетов(Расшифровка.Контрагент, ПолучитьОрганизацию(Расшифровка.Реализация));
		
		УстановитьВидимостьЭлементов();
		
		Если Расшифровка.Реализация = NULL Тогда
			
			Объект.ПриемДенег = Истина;
			ПредСтраница = Элементы.Страница_СписокЗаданий; 
			ОткрытьКлавиатуру(Истина);
			
		Иначе
			
			Объект.РежимРедактирования = Ложь;
			СписокТоваров_ПолучитьТаблицу();
			Элементы.СписокТоваров_ОтменитьПоставку.Доступность = Не ЕстьТоварыСоСтороннегоСклада();
			ПерейтиНаСтраницу("Страница_СписокТоваров");
			СписокТоваров_Вывести();		
			СписокТоваров_ВыделитьСтроку(1);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

//Список товаров
&НаКлиенте
Процедура СписокТоваров_Назад(Команда)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страница_СписокЗаданий;

КонецПроцедуры

&НаКлиенте
Процедура СписокТоваров_Далее(Команда)
	
	Элементы.ДекорацияСумма3.Заголовок = "" + Объект.ТекСумма + " руб.";
	Объект.КорректировкаРеализации = Истина;      
	
	ПредСтраница = Элементы.Страница_СписокТоваров;
	
	Если Не ОплатаНаличнымиПоКонтрагенту(Объект.ТекРеализация) Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.Страница_ПодтверждениеПокупкиКорр;
		Элементы.ДекорацияСумма4.Заголовок = "" + Объект.ТекСумма + " руб."
		
	Иначе
		ОткрытьКлавиатуру();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОткрытьКлавиатуру(Деньги = Ложь)

	Объект.ВводимаяСумма = "";  	
	Элементы.Группа11.Видимость = Не Деньги;	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страница_Клавиатура;
	
КонецПроцедуры

&НаСервере
Процедура СписокТоваров_ПолучитьТаблицу()
	
	РезультатЗапроса = ПолучитьИзВременногоХранилища(Объект.ДанныеНакладных_Адрес);
	СписокТоваров_Темп = РезультатЗапроса[5].Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокТоваров.ЗаданиеНаДоставку,
	|	СписокТоваров.Контрагент,
	|	СписокТоваров.Реализация,
	|	СписокТоваров.НомерНакладной,
	|	СписокТоваров.НомерСтрокиСч,
	|	СписокТоваров.Номенклатура,
	|	СписокТоваров.Количество,
	|	СписокТоваров.Сумма,
	|	СписокТоваров.ЭтоСтороннийСклад
	|ПОМЕСТИТЬ СписокТоваров
	|ИЗ
	|	&СписокТоваров КАК СписокТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокТоваров.Реализация,
	|	СписокТоваров.НомерНакладной,
	|	СписокТоваров.НомерСтрокиСч,
	|	СписокТоваров.Номенклатура,
	|	СписокТоваров.Количество,
	|	СписокТоваров.Количество КАК ВводимоеКоличество,
	|	СписокТоваров.Сумма,
	|	СписокТоваров.ЭтоСтороннийСклад
	|ИЗ
	|	СписокТоваров КАК СписокТоваров
	|ГДЕ
	|	СписокТоваров.ЗаданиеНаДоставку = &ЗаданиеНаДоставку
	|	И СписокТоваров.Контрагент = &Контрагент
	|	И СписокТоваров.Реализация = &Реализация";
	
	Запрос.УстановитьПараметр("СписокТоваров", СписокТоваров_Темп);
	Запрос.УстановитьПараметр("ЗаданиеНаДоставку", Объект.ТекЗадание);
	Запрос.УстановитьПараметр("Контрагент", Объект.ТекКонтрагент);
	Запрос.УстановитьПараметр("Реализация", Объект.ТекРеализация);
	
	СписокТоваров_Таблица = Запрос.Выполнить().Выгрузить();
	
	Объект.СписокТоваров_Таблица.Загрузить(СписокТоваров_Таблица);
	Объект.СписокТоваров_Адрес = ПоместитьВоВременноеХранилище(СписокТоваров_Таблица, Новый УникальныйИдентификатор); 
	Объект.СписокТоваров_ТекСтрока = 1;
	Объект.СписокТоваров_ТекСтраница = 1;
	Объект.СписокТоваров_КоличествоСтрок = СписокТоваров_Таблица.Количество();
	Объект.СписокТоваров_КоличествоСтраниц = Цел(Объект.СписокТоваров_КоличествоСтрок / КоличествоСтрокТоваров);	
	
	Если Цел(Объект.СписокТоваров_КоличествоСтрок / КоличествоСтрокТоваров) < Объект.СписокТоваров_КоличествоСтрок / КоличествоСтрокТоваров Тогда
		Объект.СписокТоваров_КоличествоСтраниц = Объект.СписокТоваров_КоличествоСтраниц + 1;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СписокТоваров_Вывести()
	
	СписокТоваров.Очистить();
	СписокТоваров_Таблица = ПолучитьИзВременногоХранилища(Объект.СписокТоваров_Адрес);		
	
	Макет = Обработки.АРМ_Водитель.ПолучитьМакет("СписокТоваров");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	СписокТоваров.Вывести(ОбластьМакета);
	
	Если Объект.СписокТоваров_ТекСтраница > Объект.СписокТоваров_КоличествоСтраниц Тогда
		Объект.СписокТоваров_ТекСтраница = 1;
	ИначеЕсли Объект.СписокТоваров_ТекСтраница < 1 Тогда
		Объект.СписокТоваров_ТекСтраница = Объект.СписокТоваров_КоличествоСтраниц;
	КонецЕсли;
	
	Элементы.СписокТоваров_ТекСтраницаПредставление.Заголовок = "" + Объект.СписокТоваров_ТекСтраница + " из " + Объект.СписокТоваров_КоличествоСтраниц;
	Элементы.СписокТоваров_Меньше.Доступность = НЕ (Объект.СписокТоваров_КоличествоСтраниц = 1 Или Объект.СписокТоваров_ТекСтраница = 1);
	Элементы.СписокТоваров_Больше.Доступность = НЕ (Объект.СписокТоваров_КоличествоСтраниц = 1 Или Объект.СписокТоваров_ТекСтраница = Объект.СписокТоваров_КоличествоСтраниц);
	
	Сч = (Объект.СписокТоваров_ТекСтраница - 1) * КоличествоСтрокТоваров;
	
	Для Сч = (Объект.СписокТоваров_ТекСтраница - 1) * КоличествоСтрокТоваров По Мин(Объект.СписокТоваров_КоличествоСтрок - 1, (Объект.СписокТоваров_ТекСтраница * КоличествоСтрокТоваров - 1)) Цикл
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Заполнить(СписокТоваров_Таблица[Сч]);
		ОбластьМакета.Параметры.НомерСтрокиСч = Сч + 1;
		
		Структура = Новый Структура;
		Структура.Вставить("Реализация", СписокТоваров_Таблица[Сч].Реализация);
		Структура.Вставить("НомерСтрокиСч", СписокТоваров_Таблица[Сч].НомерСтрокиСч);
		Структура.Вставить("Номенклатура", СписокТоваров_Таблица[Сч].Номенклатура);
		
		Стр = Объект.СписокТоваров_Таблица.НайтиСтроки(Структура)[0];
		ОбластьМакета.Параметры.Количество = Стр.ВводимоеКоличество;
		
		Если Стр.Количество = Стр.ВводимоеКоличество Тогда
			Стр.Сумма = СписокТоваров_Таблица[Сч].Сумма;
		Иначе
			Стр.Сумма = СписокТоваров_Таблица[Сч].Сумма * Стр.ВводимоеКоличество / СписокТоваров_Таблица[Сч].Количество; 
		КонецЕсли;
		
		ОбластьМакета.Параметры.Артикул = ОбластьМакета.Параметры.Номенклатура.Артикул;
		ОбластьМакета.Параметры.Сумма = Стр.Сумма;
		ОбластьМакета.Параметры.Структура = Структура;
		СписокТоваров.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	Объект.ТекСумма = Объект.СписокТоваров_Таблица.Итог("Сумма");
	
	Если Объект.СписокТоваров_ТекСтраница = Объект.СписокТоваров_КоличествоСтраниц Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.Сумма = Объект.СписокТоваров_Таблица.Итог("Сумма");
		СписокТоваров.Вывести(ОбластьМакета);
		
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура ГрузовыеМеста_ПолучитьТаблицу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки
		|ПОМЕСТИТЬ ДокументыСборки
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
		|ГДЕ
		|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка = &ТекРеализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(ГрузовоеМесто.Ссылка) КАК ГрузовоеМесто
		|ИЗ
		|	Документ.ГрузовоеМесто КАК ГрузовоеМесто
		|ГДЕ
		|	ГрузовоеМесто.Сборка В
		|			(ВЫБРАТЬ
		|				ДокументыСборки.ДокументСборки
		|			ИЗ
		|				ДокументыСборки КАК ДокументыСборки)
		|	И ГрузовоеМесто.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ТекРеализация", Объект.ТекРеализация);
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаГрузовыхМест = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Объект.СписокГрузовыхМест_Таблица.Загрузить(ТаблицаГрузовыхМест);
	
КонецПроцедуры


&НаСервере
Процедура ГрузовыеМеста_Вывести()
	
	
КонецПроцедуры


&НаКлиенте
Процедура СписокТоваров_УстановитьПервуюСтроку()
	
	Объект.СписокТоваров_ТекСтрока = 1;
	Элементы.СписокТоваров.ТекущаяОбласть = СписокТоваров.Область(2, 1, 2, 5);
	СписокТоваров_ВыделитьСтроку(1);

КонецПроцедуры

&НаКлиенте
Функция СписокТоваров_ПолучитьКоличествоСтрокНаСтранице()
	
	Если Объект.СписокТоваров_ТекСтраница = Объект.СписокТоваров_КоличествоСтраниц Тогда
		Возврат КоличествоСтрокТоваров - (Объект.СписокТоваров_КоличествоСтраниц * КоличествоСтрокТоваров - Объект.СписокТоваров_КоличествоСтрок);
	Иначе
		Возврат КоличествоСтрокТоваров;
	КонецЕсли;	

КонецФункции

&НаКлиенте
Процедура СписокТоваров_Больше(Команда)
	
	Объект.СписокТоваров_ТекСтраница = Объект.СписокТоваров_ТекСтраница + 1;
	СписокТоваров_Вывести();
	СписокТоваров_УстановитьПервуюСтроку();

КонецПроцедуры

&НаКлиенте
Процедура СписокТоваров_Меньше(Команда)
	
	Объект.СписокТоваров_ТекСтраница = Объект.СписокТоваров_ТекСтраница - 1;
	СписокТоваров_Вывести();
	СписокТоваров_УстановитьПервуюСтроку();

КонецПроцедуры

&НаКлиенте
Процедура СписокТоваров_ВыделитьСтроку(НомерСтроки)
	
	ОбластьТекущейСтроки = СписокТоваров.Область(НомерСтроки + 1, 1, НомерСтроки + 1, 5);
	ОбластьТекущейСтроки.ЦветФона = ?(Объект.РежимРедактирования, WebЦвета.Голубой, WebЦвета.Желтый);
	
	Если СписокТоваров_ПредОбласть = Неопределено Тогда
		СписокТоваров_ПредОбласть = ОбластьТекущейСтроки;
	ИначеЕсли НЕ СписокТоваров_ПредОбласть.Имя = ОбластьТекущейСтроки.Имя Тогда
		СписокТоваров_ПредОбласть.ЦветФона = WebЦвета.Белый;
		СписокТоваров_ПредОбласть = ОбластьТекущейСтроки;
	КонецЕсли; 	
	
	Если Объект.РежимРедактирования Тогда
		
		Объект.ТекРеализация = ОбластьТекущейСтроки.Расшифровка.Реализация;
		Объект.ТекНомерСтроки = ОбластьТекущейСтроки.Расшифровка.НомерСтрокиСч;
		Объект.ТекНоменклатура = ОбластьТекущейСтроки.Расшифровка.Номенклатура;
				
		Структура = Новый Структура;
		Структура.Вставить("Реализация", Объект.ТекРеализация);
		Структура.Вставить("НомерСтрокиСч", Объект.ТекНомерСтроки);
		Структура.Вставить("Номенклатура", Объект.ТекНоменклатура);
		Стр = Объект.СписокТоваров_Таблица.НайтиСтроки(Структура)[0];
				
		Элементы.СписокТоваров_УменьшитьКоличество.Доступность = НЕ Стр.ВводимоеКоличество = 0 И НЕ Стр.ЭтоСтороннийСклад;
		Элементы.СписокТоваров_УвеличитьКоличество.Доступность = НЕ Стр.ВводимоеКоличество = Стр.Количество И НЕ Стр.ЭтоСтороннийСклад;
		Элементы.СписокТоваров_Очистить.Доступность = Не Стр.ЭтоСтороннийСклад
	
	КонецЕсли;
	
	УстановитьВидимостьГруппНаСервере(Объект.РежимРедактирования)
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 

КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПриАктивизацииОбласти(Элемент)
	
	Объект.СписокТоваров_ТекСтрока = СписокТоваров.ТекущаяОбласть.Верх - 1;
	
	Если Объект.СписокТоваров_ТекСтрока < 1 Или Объект.СписокТоваров_ТекСтрока > СписокТоваров_ПолучитьКоличествоСтрокНаСтранице() Тогда
		СписокТоваров_УстановитьПервуюСтроку();
	Иначе
		СписокТоваров_ВыделитьСтроку(Объект.СписокТоваров_ТекСтрока);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокТоваров_ПодтвердитьПоставку(Команда)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страница_ПодтверждениеПокупки;
	Элементы.ДекорацияСумма1.Заголовок = "" + Объект.ТекСумма + " руб.";
	Элементы.ДекорацияСумма7.Заголовок = "" + Объект.ТекОстатокВзаиморасчетов + " руб.";

КонецПроцедуры

&НаКлиенте
Процедура СписокТоваров_ИзменитьПоставку(Команда)
	
	Объект.РежимРедактирования = Истина;
	СписокТоваров_ВыделитьСтроку(Объект.СписокТоваров_ТекСтрока);

КонецПроцедуры

&НаКлиенте
Процедура СписокТоваров_ОтменитьПоставку(Команда)
	
	Элементы.ДекорацияСумма5.Заголовок = "" + Объект.ТекСумма + " руб.";
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страница_Отказ;

КонецПроцедуры

&НаКлиенте
Процедура СписокТоваров_УвеличитьКоличество(Команда)
	
	Если Объект.РежимРедактирования Тогда	
		
		Структура = Новый Структура;
		Структура.Вставить("Реализация", Объект.ТекРеализация);
		Структура.Вставить("НомерСтрокиСч", Объект.ТекНомерСтроки);
		Структура.Вставить("Номенклатура", Объект.ТекНоменклатура);
		
		Кратность = ПолучитьКратностьТовара(Объект.ТекНоменклатура);
		НаСколькоУвеличить = 1 * Кратность;
		
		Стр = Объект.СписокТоваров_Таблица.НайтиСтроки(Структура)[0];
		
		СколькоВИтогеПолучится =  Стр.ВводимоеКоличество + НаСколькоУвеличить;
		
		Если СколькоВИтогеПолучится > Стр.Количество Тогда
			Возврат;
		КонецЕсли;
		
		Стр.ВводимоеКоличество = СколькоВИтогеПолучится;
		
		Элементы.СписокТоваров_УменьшитьКоличество.Доступность = НЕ Стр.ВводимоеКоличество = 0;
		Элементы.СписокТоваров_УвеличитьКоличество.Доступность = НЕ Стр.ВводимоеКоличество = Стр.Количество;
		СписокТоваров_Вывести();
		ОбластьТекущейСтроки = СписокТоваров.Область(Объект.ТекНомерСтроки + 1, 1, Объект.ТекНомерСтроки + 1, 5);
		ОбластьТекущейСтроки.ЦветФона = WebЦвета.Голубой;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваров_УменьшитьКоличество(Команда)
	
	Если Объект.РежимРедактирования Тогда
		
		Структура = Новый Структура;
		Структура.Вставить("Реализация", Объект.ТекРеализация);
		Структура.Вставить("НомерСтрокиСч", Объект.ТекНомерСтроки);
		Структура.Вставить("Номенклатура", Объект.ТекНоменклатура);
		
		Кратность = ПолучитьКратностьТовара(Объект.ТекНоменклатура);
		НаСколькоУменьшить = 1 * Кратность;
		
		Стр = Объект.СписокТоваров_Таблица.НайтиСтроки(Структура)[0];
		
		СколькоВИтогеПолучится =  Стр.ВводимоеКоличество - НаСколькоУменьшить;
		
		Если СколькоВИтогеПолучится < 0 Тогда
			Возврат;
		КонецЕсли;
		
		Стр.ВводимоеКоличество = СколькоВИтогеПолучится;
		
		Элементы.СписокТоваров_УменьшитьКоличество.Доступность = НЕ Стр.ВводимоеКоличество = 0;
		Элементы.СписокТоваров_УвеличитьКоличество.Доступность = НЕ Стр.ВводимоеКоличество = Стр.Количество;
		СписокТоваров_Вывести();
		ОбластьТекущейСтроки = СписокТоваров.Область(Объект.ТекНомерСтроки + 1, 1, Объект.ТекНомерСтроки + 1, 5);
		ОбластьТекущейСтроки.ЦветФона = WebЦвета.Голубой;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьКратностьТовара(Номенклатура)
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Номенклатура.Кратность;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура СписокТоваров_Очистить(Команда)
	
	Если Объект.РежимРедактирования Тогда	
		
		Структура = Новый Структура;
		Структура.Вставить("Реализация", Объект.ТекРеализация);
		Структура.Вставить("НомерСтрокиСч", Объект.ТекНомерСтроки);
		Структура.Вставить("Номенклатура", Объект.ТекНоменклатура);
		Стр = Объект.СписокТоваров_Таблица.НайтиСтроки(Структура)[0];
		Стр.ВводимоеКоличество = 0;
		
		Элементы.СписокТоваров_УменьшитьКоличество.Доступность = НЕ Стр.ВводимоеКоличество = 0;
		Элементы.СписокТоваров_УвеличитьКоличество.Доступность = НЕ Стр.ВводимоеКоличество = Стр.Количество;
		СписокТоваров_Вывести();
		ОбластьТекущейСтроки = СписокТоваров.Область(Объект.ТекНомерСтроки + 1, 1, Объект.ТекНомерСтроки + 1, 5);
		ОбластьТекущейСтроки.ЦветФона = WebЦвета.Голубой;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокТоваров_Вернуть(Команда)
	
	Если Объект.РежимРедактирования Тогда	
		
		Структура = Новый Структура;
		Структура.Вставить("Реализация", Объект.ТекРеализация);
		Структура.Вставить("НомерСтрокиСч", Объект.ТекНомерСтроки);
		Структура.Вставить("Номенклатура", Объект.ТекНоменклатура);
		Стр = Объект.СписокТоваров_Таблица.НайтиСтроки(Структура)[0];
		Стр.ВводимоеКоличество = Стр.Количество;
		
		Элементы.СписокТоваров_УменьшитьКоличество.Доступность = НЕ Стр.ВводимоеКоличество = 0 И НЕ Стр.ЭтоСтороннийСклад;
		Элементы.СписокТоваров_УвеличитьКоличество.Доступность = НЕ Стр.ВводимоеКоличество = Стр.Количество И НЕ Стр.ЭтоСтороннийСклад;
		Элементы.СписокТоваров_Очистить.Доступность = Не Стр.ЭтоСтороннийСклад;
		
		СписокТоваров_Вывести();
		ОбластьТекущейСтроки = СписокТоваров.Область(Объект.ТекНомерСтроки + 1, 1, Объект.ТекНомерСтроки + 1, 5);
		ОбластьТекущейСтроки.ЦветФона = WebЦвета.Голубой;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьГрузовыеМеста(Команда)
	
	Если Элементы.СписокЗаданий.ТекущаяОбласть = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.СписокЗаданий.ТекущаяОбласть.Расшифровка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Расшифровка	=	Элементы.СписокЗаданий.ТекущаяОбласть.Расшифровка;
	
	Объект.ТекЗадание = Расшифровка.ЗаданиеНаДоставку;
	Объект.ТекКонтрагент = Расшифровка.Контрагент;
	Объект.ТекРеализация = Расшифровка.Реализация;
	Объект.ТекСумма = Расшифровка.Сумма;
	Объект.ТекОстатокВзаиморасчетов = ПолучитьОстатокВзаиморасчетов(Расшифровка.Контрагент, ПолучитьОрганизацию(Расшифровка.Реализация));
	
	Объект.РежимРедактирования = Ложь;
	ГрузовыеМеста_ПолучитьТаблицу();
	ПерейтиНаСтраницу("Страница_ГрузовыеМеста");			
	ГрузовыеМеста_Вывести();		
	
КонецПроцедуры

//Подтверждение покупки
&НаСервере
Процедура ЗаписатьДействие(Безнал = Ложь, Отмена = Ложь, Деньги = Ложь) 
	
	МЗ = РегистрыСведений.ОчередьПечатиККМ.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, Объект);
	МЗ.ДатаПостановкиВОчередь = ТекущаяДата();
	
	Если Деньги Тогда
		
		МЗ.ДокументЧек = ПолныеПрава.СоздатьПриемДенег(Объект.ТекКонтрагент, Объект.ВводимаяСумма);
		МЗ.ТекСумма = Объект.ВводимаяСумма;
		
	Иначе
		
		МЗ.ДокументЧек = ПолныеПрава.СоздатьРКО(Объект.ТекРеализация, Объект.ТекСумма, Объект.РКО, Объект.КорректировкаРеализации, Объект.СписокТоваров_Таблица, Объект.ТекКонтрагент, Безнал);
		МЗ.ТекСумма = Объект.ТекСумма;	
		
	КонецЕсли;
	
	МЗ.Отмена = Отмена;
	МЗ.Деньги = Деньги;
	
	Если Деньги ИЛИ Объект.РКО Тогда
		МЗ.Обработано = Истина;	
	КонецЕсли;
	
	МЗ.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеПокупки_Назад(Команда)
	
	ПерейтиНаСтраницу("Страница_СписокТоваров");

КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеПокупкиКорр_Назад(Команда)
	
	ПерейтиНаСтраницу("Страница_СписокТоваров");

КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеПокупки_ЧекСуммаПоставки(Команда)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страница_ПлатежСовершен;
	Элементы.ДекорацияСумма2.Заголовок = "" + Объект.ТекСумма + " руб.";
	Объект.РКО = Истина;
	Объект.КорректировкаРеализации = Ложь;
	ЗаписатьДействие();

КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеПокупкиКорр_Чек(Команда)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страница_ПлатежСовершен;
	Элементы.ДекорацияСумма2.Заголовок = "" + Объект.ТекСумма + " руб.";
	Объект.РКО = Истина;
	ИзменитьСтатусРеализации(ПредопределенноеЗначение("Перечисление.СтатусыДоставки.ТоварПередан"));
	ЗаписатьДействие();

КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеПокупки_ЧекСвободнаяСумма(Команда)
	
	ПредСтраница = Элементы.Страница_ПодтверждениеПокупки;
	ОткрытьКлавиатуру();
	Элементы.ДекорацияСумма3.Заголовок = "" + Объект.ТекСумма + " руб.";

КонецПроцедуры

&НаСервере
Процедура ЗаписатьДвиженияПоТоварамНаДоставке()
	
	ДокументРеализации	=	Объект.ТекРеализация;
	
	Флаг_ТоварПередан = РаботаСТоварамиНаДоставке.ТоварПередан(ДокументРеализации);
	
	Если Флаг_ТоварПередан Тогда
		ДатаВключенияТоваровНаДоставке	=	Константы.ДатаВключенияТоваровНаДоставке.Получить();
		
		Если (НЕ ЗНачениеЗаполнено(ДатаВключенияТоваровНаДоставке))  
		ИЛИ (НачалоДня(ДатаВключенияТоваровНаДоставке) >  ДокументРеализации.Дата) Тогда   
			//	оставляем движения
			// не трогаем документ. Если движений не было, то и не появятся. Если были, то не изменятся.
		Иначе

			ТаблицаТоварыНаДоставке_ДляПроведения = РаботаСТоварамиНаДоставке.ЗаданияРеализацияНоменклатура_ПоРеализации(ДокументРеализации);
			ТаблицаТоварыНаДоставке_ДляПроведения.Колонки.Добавить("Период");
			ТаблицаТоварыНаДоставке_ДляПроведения.ЗаполнитьЗначения(ДокументРеализации.Дата, "Период");
			
			ТоварыНаДоставке = РегистрыНакопления.ТоварыНаДоставке.СоздатьНаборЗаписей();
	        ТоварыНаДоставке.Отбор.Регистратор.Установить(ДокументРеализации);
			
			ТоварыНаДоставке.Загрузить(ТаблицаТоварыНаДоставке_ДляПроведения);
			ТоварыНаДоставке.ОбменДанными.Загрузка = Истина;
			УстановитьПривилегированныйРежим(Истина);
	        ТоварыНаДоставке.Записать(Истина); 
			УстановитьПривилегированныйРежим(Ложь);

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтатусРеализации(СтатусУстановки)
	
	СтатусДоставки = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	СтатусДоставки.Отбор.Объект.Установить(Объект.ТекРеализация);
	СтатусДоставки.Отбор.Свойство.Установить(ПланыВидовХарактеристик.СвойстваОбъектов.СтатусДоставки);
	
	УстановитьПривилегированныйРежим(Истина);	
	СтатусДоставки.Прочитать();
	УстановитьПривилегированныйРежим(Ложь);		
	
	Если СтатусДоставки.Количество() = 0 Тогда
		
		НовыйСтатусДоставки = СтатусДоставки.Добавить();
		НовыйСтатусДоставки.Объект = Объект.ТекРеализация;
		НовыйСтатусДоставки.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.СтатусДоставки;
		
	Иначе
		НовыйСтатусДоставки = СтатусДоставки[0];
	КонецЕсли;
	
	НовыйСтатусДоставки.Значение = СтатусУстановки;
	УстановитьПривилегированныйРежим(Истина);	
	СтатусДоставки.Записать();
	УстановитьПривилегированныйРежим(Ложь);		
	
	РаботаСТоварамиНаДоставке.ИзменитьДатуПередачи(Объект.ТекРеализация);
	
	ЗаписатьДвиженияПоТоварамНаДоставке();

КонецПроцедуры

//Платеж завершен
&НаКлиенте
Процедура ПлатежСовершен_Закрыть(Команда)
	ПерейтиНаГлавную();
КонецПроцедуры

//клавиатура
&НаКлиенте
Процедура Клавиатура_Назад(Команда)
	Элементы.Страницы.ТекущаяСтраница = ПредСтраница;
КонецПроцедуры

&НаКлиенте
Процедура Клавиатура_Далее(Команда)
	
	Если Объект.ВводимаяСумма = "" Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ВводимаяСумма = "0" Тогда	
		
		Если НЕ Объект.ТекОстатокВзаиморасчетов <= 0 Тогда
			Возврат;
		КонецЕсли;	
		
	КонецЕсли;
	
	Если Объект.ПриемДенег Тогда	
		
		ЗаписатьДействие(,, Истина);
		ПерейтиНаСтраницу("Страница_ДеньгиПриняты");
		Элементы.ДекорацияСумма6.Заголовок = "" + Объект.ВводимаяСумма + " руб.";
		Объект.ПриемДенег = Ложь;
		
	Иначе         		
		
		Объект.ТекСумма = Число(Объект.ВводимаяСумма);
		ПерейтиНаСтраницу("Страница_ПодтверждениеПокупкиКорр");
		Элементы.ДекорацияСумма4.Заголовок = "" + Объект.ТекСумма + " руб.";		
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницу(ИмяСтраницы)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы[ИмяСтраницы];
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьТоварыСоСтороннегоСклада()
	
	Для каждого Стр Из Объект.СписокТоваров_Таблица Цикл
		
		Если Стр.ЭтоСтороннийСклад Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииВводимойСуммы(Цифра = "")
	
	Если Цифра = "" Тогда
		Объект.ВводимаяСумма = "";
	ИначеЕсли Цифра = "," Тогда
		
		Если НЕ Найти(Объект.ВводимаяСумма, ",") Тогда 
			Объект.ВводимаяСумма = Объект.ВводимаяСумма + Цифра;
		КонецЕсли;
		
	ИначеЕсли НЕ Сред(Прав(Объект.ВводимаяСумма, 3), 1, 1) = "," Тогда
		
		Объект.ВводимаяСумма = Объект.ВводимаяСумма + Цифра;
		Объект.ВводимаяСумма = Строка(Число(Объект.ВводимаяСумма));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводЦифры(Команда)
	
	ПриИзмененииВводимойСуммы(Прав(Команда.Имя,1));	

КонецПроцедуры

&НаКлиенте
Процедура ЦифраТочка(Команда)
	
	ПриИзмененииВводимойСуммы(",");

КонецПроцедуры

&НаКлиенте
Процедура ЦифраСброс(Команда)
	
	ПриИзмененииВводимойСуммы("");

КонецПроцедуры

//есть оплата
&НаКлиенте
Процедура ЕстьОплата_Назад(Команда)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страница_СписокЗаданий;

КонецПроцедуры

//отказ
&НаКлиенте
Процедура Отказ_Назад(Команда)
	
	ПерейтиНаСтраницу("Страница_СписокТоваров");

КонецПроцедуры

&НаКлиенте
Процедура Отказ_ОтменаПоставки(Команда)
	
	Объект.РКО = ЛОЖЬ;
	Объект.КорректировкаРеализации = Истина;
	ЗаписатьДействие(, Истина);      
	ИзменитьСтатусРеализации(ПредопределенноеЗначение("Перечисление.СтатусыДоставки.ТоварПередан"));
	ПерейтиНаГлавную();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	ЗавершитьРаботуСистемы(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеПокупки(Команда)
	
	Объект.РКО = Ложь;
	ОБъект.КорректировкаРеализации = Ложь;
	ЗаписатьДействие(Истина);		
	ИзменитьСтатусРеализации(ПредопределенноеЗначение("Перечисление.СтатусыДоставки.ТоварПередан"));

	ПерейтиНаГлавную();
	
КонецПроцедуры   

&НаКлиенте
Процедура ПерейтиНаГлавную()
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страница_СписокЗаданий;
	текСтраницаТемп = Объект.СписокЗаданий_ТекСтраница;
	
	ОбновитьДанныеИВывестиВТаблицы();

	Объект.СписокЗаданий_ТекСтраница = текСтраницаТемп;
	
КонецПроцедуры

Процедура УстановитьВидимостьЭлементов()
	
	ОплатаНаличными = ОплатаНаличнымиПоКонтрагенту(Объект.ТекРеализация);
	
	Элементы.ГруппаНаличнаяОплата.Видимость = ОплатаНаличными;
	Элементы.ГруппаБезналичнаяОплата.Видимость = Не ОплатаНаличными;
	
	Элементы.ПодтверждениеПокупкиКорр_Чек.Видимость = ОплатаНаличными;
	Элементы.ПодтверждениеПокупкиКорр.Видимость = Не ОплатаНаличными;
	
	Элементы.ПоказатьГрузовыеМеста.Видимость	=	Истина;
	Элементы.СписокТоваров_ПринятьДеньги.Видимость = ОплатаНаличными;
	
КонецПроцедуры

&НаСервере
Функция ОплатаНаличнымиПоКонтрагенту(Реализация)
	
	Если Реализация = NULL Тогда
		Возврат Ложь;
	Иначе
		
		ОплатаНаличными = (Реализация.Организация = Константы.ОсновнаяОрганизацияДляОплатыНаличнымиДляВодителей.Получить());
		
		Если Не ОплатаНаличными Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ЕСТЬNULL(ПродажиОбороты.ЗаказПокупателя.ОплатаНаличными, ЛОЖЬ) КАК ОплатаНаличными
			               |ИЗ
			               |	РегистрНакопления.Продажи.Обороты(, , , ДокументПродажи = &Реализация) КАК ПродажиОбороты";
			
			Запрос.УстановитьПараметр("Реализация", Реализация);
			
			УстановитьПривилегированныйРежим(Истина);
			Выборка = Запрос.Выполнить().Выбрать();
			УстановитьПривилегированныйРежим(Ложь);
			
			Если Выборка.Следующий() Тогда
				ОплатаНаличными = Выборка.ОплатаНаличными;
			Иначе
				ОплатаНаличными = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат ОплатаНаличными;
		
	КонецЕсли;
	
КонецФункции

Функция БылаОтменаПоставки(Задание, Контрагент, Реализация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОчередьПечатиККМ.ДатаПостановкиВОчередь
	               |ИЗ
	               |	РегистрСведений.ОчередьПечатиККМ КАК ОчередьПечатиККМ
	               |ГДЕ
	               |	ОчередьПечатиККМ.ДокументЧек = ЗНАЧЕНИЕ(Документ.ПриходныйКассовыйОрдер.ПустаяСсылка)
	               |	И ОчередьПечатиККМ.ТекКонтрагент = &Контрагент
	               |	И ОчередьПечатиККМ.ТекРеализация = &Реализация
	               |	И ОчередьПечатиККМ.ТекЗадание = &Задание
	               |	И ОчередьПечатиККМ.Отмена";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Реализация", Реализация);
	Запрос.УстановитьПараметр("Задание", Задание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь; 	
	
КонецФункции

Функция БылПриемДенег(Задание, Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОчередьПечатиККМ.ДатаПостановкиВОчередь
	               |ИЗ
	               |	РегистрСведений.ОчередьПечатиККМ КАК ОчередьПечатиККМ
	               |ГДЕ
	               |	ОчередьПечатиККМ.ТекКонтрагент = &Контрагент
	               |	И ОчередьПечатиККМ.ТекЗадание = &Задание
	               |	И ОчередьПечатиККМ.Деньги";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Задание", Задание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь; 	
	
КонецФункции

&НаКлиенте
Процедура ПодтверждениеПокупкиКорр(Команда)

	Объект.РКО = Ложь;
	ОБъект.КорректировкаРеализации = Истина;
	ЗаписатьДействие(Истина);    		
	ИзменитьСтатусРеализации(ПредопределенноеЗначение("Перечисление.СтатусыДоставки.ТоварПередан"));
	ПерейтиНаГлавную();

КонецПроцедуры

Процедура ПроставитьСуммуПлатежа()
	
	Элементы.ДекорацияСумма2.Заголовок = "" + Объект.ТекСумма + " руб.";
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваров_ПринятьДеньги(Команда)
	
	Объект.ПриемДенег = Истина;
	ПредСтраница = Элементы.Страница_СписокТоваров; 
	ОткрытьКлавиатуру(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеньгиПриняты_Закрыть(Команда)
	
	ПерейтиНаГлавную();

КонецПроцедуры

&НаКлиенте
Процедура ТекВодительПриИзменении(Элемент)
	
	ОбновитьДанныеИВывестиВТаблицы();

КонецПроцедуры

&НаКлиенте
Процедура ТекДатаПриИзменении(Элемент)
	
	ОбновитьДанныеИВывестиВТаблицы();

КонецПроцедуры

Функция ПолучитьОстатокВзаиморасчетов(Контрагент,Организация)
	
	Если Контрагент.ГоловнойКонтрагент <> Контрагент Тогда
		КонтрагентЗапроса = Контрагент.ГоловнойКонтрагент;
	Иначе
		КонтрагентЗапроса = Контрагент;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(, Контрагент = &Контрагент И Организация = &Организация) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки";
	
	Запрос.УстановитьПараметр("Контрагент", КонтрагентЗапроса);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДанныеИВывестиВТаблицы();
	ЗаполнитьЗаданияДляВыбора();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаданияДляВыбора()
	
	РезультатЗапроса = ПолучитьИзВременногоХранилища(Объект.ДанныеНакладных_Адрес);
	СписокЗаданий_Таблица = РезультатЗапроса[6].Выгрузить();
	
	НетЗаданий = СписокЗаданий_Таблица.Количество() = 0;
	
	Элементы.ДекорацияОтсутствуютЗадания.Видимость = НетЗаданий;
	Элементы.ДекорацияВыберитеЗадание.Видимость = Не НетЗаданий;
	Элементы.ТаблицаЗаданий.Видимость = НЕ НетЗаданий;
	Элементы.Ок.Видимость = НЕ НетЗаданий;
	
	Если СписокЗаданий_Таблица.Количество() = 1 Тогда
		
		Объект.Задание = СписокЗаданий_Таблица[0].ЗаданиеНаДоставку;
		СписокЗаданий_ПолучитьТаблицу();
		СписокЗаданий_Вывести();
		Элементы.Страницы.ТекущаяСтраница = Элементы.Страница_СписокЗаданий;
		
	ИначеЕсли СписокЗаданий_Таблица.Количество() > 1 Тогда
		
		Для каждого Стр Из СписокЗаданий_Таблица Цикл
			
			НоваяСтрока = ТаблицаЗаданий.Добавить();
			НоваяСтрока.Задание = Стр.ЗаданиеНаДоставку;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗаданиеНаДоставку(Команда)
	
	Объект.Задание = Элементы.ТаблицаЗаданий.ТекущиеДанные.Задание;
	СписокЗаданий_ПолучитьТаблицу();
	СписокЗаданий_Вывести();
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страница_СписокЗаданий;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеВойти(Команда)
	
	Если Элементы.СписокЗаданий.ТекущаяОбласть = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.СписокЗаданий.ТекущаяОбласть.Расшифровка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокЗаданийОбработкаРасшифровки(Элементы.СписокЗаданий, Элементы.СписокЗаданий.ТекущаяОбласть.Расшифровка, Истина)
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваров_НеДоставлен(Команда)
	
	ПредСтраница = Элементы.Страница_СписокТоваров;
	Элементы.ДекорацияСумма8.Заголовок = "" + Объект.ТекСумма + " руб.";
	ПерейтиНаСтраницу("Страница_НеДоставлен");
	
КонецПроцедуры

&НаКлиенте
Процедура Отказ_НеДоставлен(Команда)
	
	ИзменитьСтатусРеализации(ПредопределенноеЗначение("Перечисление.СтатусыДоставки.ТоварНеДоставлен"));
	ПерейтиНаГлавную();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОрганизацию(Документ)
	
	Возврат Документ.Организация;

КонецФункции 

&НаСервере
Процедура УстановитьВидимостьГруппНаСервере(Видимость)
	
	Элементы.Группа5.Видимость = НЕ Видимость;
	Элементы.Группа8.Видимость = Видимость;
	Элементы.Группа21.Видимость = Видимость;
	Элементы.СписокТоваров_Далее.Видимость = Видимость;

КонецПроцедуры
